Revit 2024 API
RebarRoundingManager.ApplicableTotalLengthRoundingMethod Property
 The applicable rounding method for Bar Length and Total Bar Length parameters.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public RoundingMethod ApplicableTotalLengthRoundingMethod { get; }
Visual Basic
Public ReadOnly Property ApplicableTotalLengthRoundingMethod As RoundingMethod
	Get
Visual C++
public:
property RoundingMethod ApplicableTotalLengthRoundingMethod {
	RoundingMethod get ();
}
Remarks
 IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableTotalLengthRoundingMethod is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace